Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
    }

    // force a context switch
		taskYIELD();
  }
}



// === Scheduler config ===
#define BASE_TICK_US 100   // base tick in microseconds
#define MAX_TASKS    10     // maximum tasks in scheduler

// Task entry struct
typedef struct {
  TaskHandle_t handle;
  const char *name;
  TaskFunction_t fn;
  uint16_t intervalTicks;
  uint16_t counter;
  uint32_t lastKick;   // last time task ran (micros)
  UBaseType_t priority;
  BaseType_t core;
} SchedTask;

// Task table
SchedTask tasks[MAX_TASKS];
uint8_t taskCount = 0;

// Timer handle
hw_timer_t *timer0 = NULL;

// === Scheduler ISR ===
void IRAM_ATTR onTimer(void* arg) {
  BaseType_t xHigherPriorityWoken = pdFALSE;

  for (int i = 0; i < taskCount; i++) {
    tasks[i].counter++;
    if (tasks[i].counter >= tasks[i].intervalTicks) {
      tasks[i].counter = 0;
      if(NULL != tasks[i].handle)
      {
        vTaskNotifyGiveFromISR(tasks[i].handle, &xHigherPriorityWoken);
      }
      
    }
  }

  // Yield if a higher-priority task was woken.
  if (xHigherPriorityWoken) {
    portYIELD_FROM_ISR();
  }
}

// === Scheduler API ===
void addScheduledTask(TaskFunction_t fn, const char *name, uint16_t intervalUs,
                      UBaseType_t priority, BaseType_t core, uint32_t stackSize = 2048u) {
  if (taskCount >= MAX_TASKS) return;  // limit reached

  uint16_t intervalTicks = intervalUs / BASE_TICK_US;
  if (intervalTicks == 0) intervalTicks = 1;  // minimum 1 tick

  // Create task
  xTaskCreatePinnedToCore(fn, name, stackSize, NULL, priority,
                          &tasks[taskCount].handle, core);

  tasks[taskCount].intervalTicks = intervalTicks;
  tasks[taskCount].counter = 0;
  taskCount++;
}




TaskHandle_t handle_pedalUpdateTask = NULL;
TaskHandle_t handle_joystickOutput = NULL;
TaskHandle_t handle_loadcellReadingTask = NULL;
TaskHandle_t handle_profilerTask = NULL;
TaskHandle_t handle_serialCommunicationRx = NULL; 
TaskHandle_t handle_serialCommunicationTx = NULL; 
TaskHandle_t handle_miscTask = NULL; 
TaskHandle_t handle_otaTask = NULL;
TaskHandle_t handle_espnowTask = NULL;

#define COUNTER_SIZE 4u
uint16_t tickCount_au16[COUNTER_SIZE] = {0};


static uint16_t timerTicks_espNowTask_u16 = REPETITION_INTERVAL_ESPNOW_TASK_IN_US / BASE_TICK_US;




/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/
#include "driver/uart.h"

// Structure to hold a complete UART packet
#define UART_RX_BUF_SIZE sizeof(DAP_config_st)
typedef struct {
    uint8_t data[UART_RX_BUF_SIZE];
    size_t len;
} UartPacket_t;

// Queue to pass packets from the UART event task to the processing task
static QueueHandle_t serial_packet_queue;

// Queue to handle UART events
static QueueHandle_t uart_queue;

// --- ADD THIS LINE ---
#define TEMP_BUFFER_SIZE (UART_RX_BUF_SIZE * 2)

/**
 * @brief Task to handle UART events with persistent buffering.
 *
 * This task accumulates data in a static buffer. After new data arrives,
 * it scans the buffer for one or more complete packets ending in the
 * {EOF_BYTE_0, EOF_BYTE_1} sequence. Valid packets are extracted, queued
 * for processing, and removed from the buffer.
 */
static void uart_event_task(void *pvParameters) {
    uart_event_t event;
    
    // Persistent buffer to accumulate fragmented data
    static uint8_t temp_buffer[TEMP_BUFFER_SIZE];
    static size_t temp_buffer_len = 0;

    for (;;) {
        // Wait for a UART event
        if (xQueueReceive(uart_queue, (void *)&event, (TickType_t)portMAX_DELAY)) {
            
            switch (event.type) {
                case UART_PATTERN_DET: {
                    // Read all available new data from the hardware buffer
                    uint8_t incoming_data[UART_RX_BUF_SIZE];
                    size_t buffered_size;
                    uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
                    int read_len = uart_read_bytes(UART_NUM_0, incoming_data, buffered_size, pdMS_TO_TICKS(100));

                    if (read_len > 0) {
                        // --- 1. Append new data, checking for overflow ---
                        if (temp_buffer_len + read_len > TEMP_BUFFER_SIZE) {
                            Serial.println("ERROR: UART temporary buffer overflow. Discarding all data.");
                            temp_buffer_len = 0; // Reset the buffer
                            break; 
                        }
                        memcpy(&temp_buffer[temp_buffer_len], incoming_data, read_len);
                        temp_buffer_len += read_len;

                        // --- 2. Scan buffer for complete packets and process them ---
                        size_t search_offset = 0;
                        while (search_offset < temp_buffer_len - 1) {
                            // Find the next EOF sequence
                            if (temp_buffer[search_offset] == EOF_BYTE_0 && temp_buffer[search_offset + 1] == EOF_BYTE_1) {
                                
                                size_t packet_len = search_offset + 2;

                                // --- 3. Extract the packet and send it to the queue ---
                                UartPacket_t packet_to_send;
                                packet_to_send.len = packet_len;
                                memcpy(packet_to_send.data, temp_buffer, packet_len);
                                xQueueSend(serial_packet_queue, &packet_to_send, (TickType_t)0);

                                // --- 4. Remove the processed packet by shifting the buffer ---
                                size_t remaining_len = temp_buffer_len - packet_len;
                                memmove(temp_buffer, &temp_buffer[packet_len], remaining_len);
                                temp_buffer_len = remaining_len;

                                // Reset search to the beginning of the now-modified buffer
                                search_offset = 0;
                                continue; // Restart scan
                            }
                            search_offset++;
                        }
                    }
                    break;
                }

