Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  Serial.println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif

  #ifdef USING_BUZZER
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==0)
    {
      delay(500);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
    }
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==1)
    {
      Buzzer.single_beep_ledc_fade(NOTE_A4,3072,1);
    }    
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==2)
    {
      delay(500);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
    }    
    //Buzzer.single_beep_tone(440,1500);
  #endif

    // stepper->pauseTask();

}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters()
{

  DAP_config_st dap_config_st_local = global_dap_config_class.getConfig();

  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payLoadPedalConfig_.pedalStartPosition, dap_config_st_local.payLoadPedalConfig_.pedalEndPosition);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/

void printTaskStats() {
    // Static variables to persist between calls
    static TaskStatus_t *pxPreviousTaskArray = NULL;
    static uint32_t ulPreviousTotalRunTime = 0;
    static UBaseType_t uxPreviousArraySize = 0;

    TaskStatus_t *pxCurrentTaskArray;
    volatile UBaseType_t uxCurrentArraySize;
    uint32_t ulCurrentTotalRunTime;

    // Allocate memory for the current snapshot
    uxCurrentArraySize = uxTaskGetNumberOfTasks();
    pxCurrentTaskArray = (TaskStatus_t *)pvPortMalloc(uxCurrentArraySize * sizeof(TaskStatus_t));

    // Get the current system state
    if (pxCurrentTaskArray != NULL) {
        uxCurrentArraySize = uxTaskGetSystemState(pxCurrentTaskArray, uxCurrentArraySize, &ulCurrentTotalRunTime);

        // Check if this is the first run
        if (pxPreviousTaskArray != NULL) {
            // Calculate the time difference over the last second
            uint32_t ulTotalRunTimeDelta = ulCurrentTotalRunTime - ulPreviousTotalRunTime;

            if (ulTotalRunTimeDelta > 0) {
                Serial.println("\n--- Task CPU Usage (Last Second) ---");
                Serial.printf("%-25s %10s %15s %14s %30s\n", "Task", "Core ID", "Runtime [us]", "CPU %", "Free stack space [byte]");

                for (uint8_t coreIdx = 0; coreIdx < 2; coreIdx++)
                {

                  for (UBaseType_t i = 0; i < uxCurrentArraySize; i++) {

                      if (pxCurrentTaskArray[i].xCoreID == coreIdx)
                      {
                        // Find the matching task in the previous snapshot
                        for (UBaseType_t j = 0; j < uxPreviousArraySize; j++) {
                            if (pxCurrentTaskArray[i].xHandle == pxPreviousTaskArray[j].xHandle) {
                                uint32_t ulRunTimeDelta = pxCurrentTaskArray[i].ulRunTimeCounter - pxPreviousTaskArray[j].ulRunTimeCounter;
                                float cpuPercent = (100.0f * (float)ulRunTimeDelta) / (float)ulTotalRunTimeDelta;

                                Serial.printf("%-25s %10lu %15lu %14.2f %30lu\n",
                                  pxCurrentTaskArray[i].pcTaskName,
                                  pxCurrentTaskArray[i].xCoreID,
                                  (unsigned long)ulRunTimeDelta,
                                  cpuPercent,
                                  pxCurrentTaskArray[i].usStackHighWaterMark);
                                break;
                            }
                        }
                      }
                  }


                }

                
                Serial.println("-----------------------\n");
            }
        }

        // Free the previous snapshot and save the current one for the next cycle
        if (pxPreviousTaskArray != NULL) {
            vPortFree(pxPreviousTaskArray);
        }
        pxPreviousTaskArray = pxCurrentTaskArray;
        ulPreviousTotalRunTime = ulCurrentTotalRunTime;
        uxPreviousArraySize = uxCurrentArraySize;
    } else {
        Serial.println("Failed to allocate memory for task stats.");
    }
}

void profilerTask( void * pvParameters )
{
  for(;;){
    // copy global struct to local for faster and safe executiion
    DAP_config_st dap_config_profilerTask_st = global_dap_config_class.getConfig();

    // activate profiler depending on pedal config
    if (dap_config_profilerTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_NET_RUNTIME) 
    {
      printTaskStats();
    }


    delay(5000);
    taskYIELD();
  }
}


void loop() {
  // vTaskDelete(NULL);  // Kill the Arduino loop task

  delay(5000);
  taskYIELD();
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;
  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");
  float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0;
  unsigned long servoActionLast = millis();
  bool firstReadConfig=true;

  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;


