Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // print profiler results
        // profiler_pedalUpdateTask.report();
      
      }
    }

    taskYIELD();
  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR joystickOutputTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;

  FunctionProfiler profiler_joystickOutputTask;
  profiler_joystickOutputTask.setName("JoystickOutput");
  profiler_joystickOutputTask.setNumberOfCalls(500);


  for(;;){

    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    // if(handle_joystickOutput != NULL)
    {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st jut_dap_config_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_joystickOutputTask.activate( true );
        }
        else
        {
          profiler_joystickOutputTask.activate( false );
        }

        // start profiler 0, overall function
        profiler_joystickOutputTask.start(0);


        // obtain joystick output level
        if(semaphore_updateJoystick!=NULL)
        {
          if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
          {
            //Serial.print(" 3");
            joystickNormalizedToInt32_local = joystickNormalizedToInt32;
            xSemaphoreGive(semaphore_updateJoystick);
          }
        }


        // send joystick output
        #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
          if (IsControllerReady()) 
          {
            if(dap_calculationVariables_st.Rudder_status==false)
            {
              //general output
              SetControllerOutputValue(joystickNormalizedToInt32_local);
              
              #ifdef USB_JOYSTICK
                // Restart HID output if faulty behavior was detected
                JoystickSendState();
                if(!GetJoystickStatus())
                {
                  RestartJoystick();
                  Serial.println("HID Error, Restart Joystick...");
                  //last_serial_joy_out=millis();
                }
              #endif

            }
          }
        #endif


        // start profiler 0, overall function
        profiler_joystickOutputTask.end(0);

        profiler_joystickOutputTask.end(0);

        // print profiler results
        profiler_joystickOutputTask.report();


        // force a context switch
		    taskYIELD();

      }
    }
  }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR serialCommunicationTaskRx( void * pvParameters )
{ 
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunicationRx");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;
  unsigned long printCycleCounter = 0;

  static DAP_config_st sct_dap_config_received_st;
  static DAP_config_st sct_dap_config_st;

  UartPacket_t received_packet; // To store the packet received from the queue

  for(;;){

    // Block and wait indefinitely for a packet to arrive in the queue
    if (xQueueReceive(serial_packet_queue, &received_packet, portMAX_DELAY) == pdPASS) {

        // --- START: This is the original processing logic, now using received_packet ---
        sct_dap_config_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) {
          profiler_serialCommunicationTask.activate( true );
        } else {
          profiler_serialCommunicationTask.activate( false );
        }
        
        profiler_serialCommunicationTask.start(0);
        profiler_serialCommunicationTask.start(1);

        uint16_t crc;
        bool structChecker = true;
          
        // Use the length from the received packet
        switch (received_packet.len) {

          // likely config structure 
          case sizeof(DAP_config_st):
            {
              // Copy data from the received packet buffer into the struct
              memcpy(&sct_dap_config_received_st, received_packet.data, sizeof(DAP_config_st));

              // --- The rest of your validation logic is IDENTICAL ---
              if ( sct_dap_config_received_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG ){ 
                structChecker = false;
                Serial.printf("Payload type expected: %d, received: %d\n", DAP_PAYLOAD_TYPE_CONFIG, sct_dap_config_received_st.payLoadHeader_.payloadType);
                break;
              }
              if ( sct_dap_config_received_st.payLoadHeader_.version != DAP_VERSION_CONFIG ){
                structChecker = false;
                Serial.printf("Config version expected: %d, received: %d\n", DAP_VERSION_CONFIG, sct_dap_config_received_st.payLoadHeader_.version);
                break;
              }
              crc = checksumCalculator((uint8_t*)(&(sct_dap_config_received_st.payLoadHeader_)), sizeof(sct_dap_config_received_st.payLoadHeader_) + sizeof(sct_dap_config_received_st.payLoadPedalConfig_));
              if (crc != sct_dap_config_received_st.payloadFooter_.checkSum){
                structChecker = false;
                Serial.printf("CRC expected: %u, received: %u\n", crc, sct_dap_config_received_st.payloadFooter_.checkSum);
              }

              if (structChecker == true) {
                Serial.println("Updating pedal config from serial");
                global_dap_config_class.setConfig(sct_dap_config_received_st);
                sct_dap_config_st = global_dap_config_class.getConfig();
                configUpdateAvailable = true; 
                if(sct_dap_config_st.payLoadHeader_.storeToEeprom==1) {
                  #ifdef USING_BUZZER
                  Buzzer.single_beep_tone(700,100);
                  #endif
                }
              }
            }
            break;

