Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
          // likely action structure 
          case sizeof(DAP_actions_st):
            {
              DAP_actions_st dap_actions_st;
              // Copy data from the received packet buffer into the struct
              memcpy(&dap_actions_st, received_packet.data, sizeof(DAP_actions_st));

              if ( dap_actions_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION ){ 
                  structChecker = false;
                  Serial.print("Payload type expected: ");
                  Serial.print(DAP_PAYLOAD_TYPE_ACTION);
                  Serial.print(",   Payload type received: ");
                  Serial.println(dap_actions_st.payLoadHeader_.payloadType);
                }
                if ( dap_actions_st.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
                  structChecker = false;
                  Serial.print("Config version expected: ");
                  Serial.print(DAP_VERSION_CONFIG);
                  Serial.print(",   Config version received: ");
                  Serial.println(dap_actions_st.payLoadHeader_.version);
                }
                crc = checksumCalculator((uint8_t*)(&(dap_actions_st.payLoadHeader_)), sizeof(dap_actions_st.payLoadHeader_) + sizeof(dap_actions_st.payloadPedalAction_));
                if (crc != dap_actions_st.payloadFooter_.checkSum){ 
                  structChecker = false;
                  Serial.print("CRC expected: ");
                  Serial.print(crc);
                  Serial.print(",   CRC received: ");
                  Serial.println(dap_actions_st.payloadFooter_.checkSum);
                }

				

              if (structChecker == true)
                {

                  //2= restart pedal
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==2)
                  {
                    Serial.println("ESP restart by user request");
                    ESP.restart();
                  }
                  //3= Wifi OTA
                  #ifdef ESPNOW_Enable
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==3)
                  {
                    Serial.println("Get OTA command");
                    OTA_enable_b=true;
                    //OTA_enable_start=true;
                    ESPNow_OTA_enable=false;
                  }
                  #endif
                  //4 Enable pairing
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==4)
                  {
                    #ifdef ESPNow_Pairing_function
                      Serial.println("Get Pairing command");
                      software_pairing_action_b=true;
                    #endif
                    #ifndef ESPNow_Pairing_function
                      Serial.println("no supporting command");
                    #endif
                  }
                  
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==(uint8_t)PedalSystemAction::ESP_BOOT_INTO_DOWNLOAD_MODE)
                  {
                    #ifdef ESPNow_S3
                      Serial.println("Restart into Download mode");
                      delay(1000);
                      REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                      ESP.restart();
                    #else
                      Serial.println("Command not supported");
                      delay(1000);
                    #endif
                    //ESPNOW_BootIntoDownloadMode = false;
                  }
                  if (dap_actions_st.payloadPedalAction_.system_action_u8 == (uint8_t)PedalSystemAction::PRINT_PEDAL_INFO)
                  {
                    char logString[200];
                    snprintf(logString, sizeof(logString),
                            "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%lu\n\0",
                            sct_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage() / 10.0f), dap_calculationVariables_st.stepperPosMaxEndstop, dap_calculationVariables_st.current_pedal_position);
                    Serial.println(logString);
                  }

                  // trigger ABS effect
                  if (dap_actions_st.payloadPedalAction_.triggerAbs_u8>0)
                  {
                    absOscillation.trigger();
                    if(dap_actions_st.payloadPedalAction_.triggerAbs_u8>1)
                    {
                      dap_calculationVariables_st.TrackCondition=dap_actions_st.payloadPedalAction_.triggerAbs_u8-1;
                    }
                    else
                    {
                      dap_calculationVariables_st.TrackCondition=dap_actions_st.payloadPedalAction_.triggerAbs_u8=0;
                    }
                  }
                  //RPM effect
                  _RPMOscillation.RPM_value=dap_actions_st.payloadPedalAction_.RPM_u8;
                  //G force effect
                  _G_force_effect.G_value=dap_actions_st.payloadPedalAction_.G_value-128;       
                  //wheel slip
                  if (dap_actions_st.payloadPedalAction_.WS_u8)
                  {
                    _WSOscillation.trigger();
                  }     
                  //Road impact
                  if(dap_calculationVariables_st.Rudder_status==false)
                  {
                    _Road_impact_effect.Road_Impact_value=dap_actions_st.payloadPedalAction_.impact_value_u8;
                  }
                  else
                  {

                  }
                  
                  // trigger system identification
                  if (dap_actions_st.payloadPedalAction_.startSystemIdentification_u8)
                  {
                    systemIdentificationMode_b = true;
                  }
                  // trigger Custom effect effect 1
                  if (dap_actions_st.payloadPedalAction_.Trigger_CV_1)
                  {
                    CV1.trigger();
                  }
                  // trigger Custom effect effect 2
                  if (dap_actions_st.payloadPedalAction_.Trigger_CV_2)
                  {
                    CV2.trigger();
                  }
                  // trigger return pedal position
                  if (dap_actions_st.payloadPedalAction_.returnPedalConfig_u8)
                  {
                  
                    DAP_config_st * dap_config_st_local_ptr;
                    dap_config_st_local_ptr = &sct_dap_config_st;
                    dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
                    dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
                    dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
                    dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
                    crc = checksumCalculator((uint8_t*)(&(sct_dap_config_st.payLoadHeader_)), sizeof(sct_dap_config_st.payLoadHeader_) + sizeof(sct_dap_config_st.payLoadPedalConfig_));
                    dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
                    Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
                    // Serial.print("\r\n");
                  }
                  #ifdef ESPNOW_Enable
                    if(dap_actions_st.payloadPedalAction_.Rudder_action==1)//Enable Rudder
                    {
                      if(dap_calculationVariables_st.Rudder_status==false)
                      {
                        dap_calculationVariables_st.Rudder_status=true;
                        Serial.println("Rudder on");
                        Rudder_initializing=true;
                        moveSlowlyToPosition_b=true;
                        //Serial.print("status:");
                        //Serial.println(dap_calculationVariables_st.Rudder_status);
                      }
                      else
                      {
                        dap_calculationVariables_st.Rudder_status=false;
                        Serial.println("Rudder off");
                        Rudder_deinitializing=true;
                        moveSlowlyToPosition_b=true; 

