Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                        //Serial.print("status:");
                        //Serial.println(dap_calculationVariables_st.Rudder_status);
                      }
                    }
                    if(dap_actions_st.payloadPedalAction_.Rudder_brake_action==1)
                    {
                      if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                      {
                        dap_calculationVariables_st.rudder_brake_status=true;
                        Serial.println("Rudder brake on");
                        //Serial.print("status:");
                        //Serial.println(dap_calculationVariables_st.Rudder_status);
                      }
                      else
                      {
                        dap_calculationVariables_st.rudder_brake_status=false;
                        Serial.println("Rudder brake off");
                        //Serial.print("status:");
                        //Serial.println(dap_calculationVariables_st.Rudder_status);
                      }
                    }
                    //clear rudder status
                    if(dap_actions_st.payloadPedalAction_.Rudder_action==2)
                    {
                      dap_calculationVariables_st.Rudder_status=false;
                      dap_calculationVariables_st.rudder_brake_status=false;
                      Serial.println("Rudder Status Clear");
                      Rudder_deinitializing=true;
                      moveSlowlyToPosition_b=true;

                    }
                  #endif


                }

                break;
              case sizeof(DAP_otaWifiInfo_st) : 
              Serial.println("get basic wifi info");
			  // Copy data from the received packet buffer into the struct
              memcpy(&_dap_OtaWifiInfo_st, received_packet.data, sizeof(DAP_actions_st));
				  
              #ifdef OTA_update
                if(_dap_OtaWifiInfo_st.device_ID == sct_dap_config_st.payLoadPedalConfig_.pedal_type)
                {
                  SSID=new char[_dap_OtaWifiInfo_st.SSID_Length+1];
                  PASS=new char[_dap_OtaWifiInfo_st.PASS_Length+1];
                  memcpy(SSID,_dap_OtaWifiInfo_st.WIFI_SSID,_dap_OtaWifiInfo_st.SSID_Length);
                  memcpy(PASS,_dap_OtaWifiInfo_st.WIFI_PASS,_dap_OtaWifiInfo_st.PASS_Length);
                  SSID[_dap_OtaWifiInfo_st.SSID_Length]=0;
                  PASS[_dap_OtaWifiInfo_st.PASS_Length]=0;
                  OTA_enable_b=true;
                }
              #endif
              #ifdef OTA_update_ESP32
                Serial.println("Get OTA command");
                OTA_enable_b=true;
                //OTA_enable_start=true;
                ESPNow_OTA_enable=false;
                //Serial.println("get basic wifi info");
                //Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
              #endif
              
              break;  
			default:
            Serial.printf("\nReceived packet of unexpected size: %d bytes\n", received_packet.len);
            Serial.printf("Expected config size: %d, action size: %d\n", sizeof(DAP_config_st), sizeof(DAP_actions_st));
            break; 
        }
        
        profiler_serialCommunicationTask.end(1);

        profiler_serialCommunicationTask.end(0);
        profiler_serialCommunicationTask.report();
        // --- END: Original processing logic ---
    }
    // The task will automatically block here on the next loop iteration until a new packet arrives.
  }
}


uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR serialCommunicationTaskTx( void * pvParameters )
{ 
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;
  unsigned long printCycleCounter = 0;

  static uint16_t timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;
  static uint16_t timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

  static DAP_config_st sct_dap_config_received_st;
  static DAP_config_st sct_dap_config_st;
  for(;;){

    sct_dap_config_st = global_dap_config_class.getConfig();

    // when debug flag == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT is set --> change the serial communication task time
    if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
    {
      // fast execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US / BASE_TICK_US;
    }
    else
    {
      // slow execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;   
    }


    // check if timer intervall needs to change
    if (timerTicks_serialCommunicationTask_prev_u16 != timerTicks_serialCommunicationTask_u16)
    {
      // update previous value
      timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

      Serial.print("Setting serial communication task to: ");
      Serial.print(timerTicks_serialCommunicationTask_u16 * BASE_TICK_US);
      Serial.println("us");

      
      tasks[1].intervalTicks = timerTicks_serialCommunicationTask_u16;
      tasks[1].counter = 0;  // reset counter
    }


	  if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {
	
		// activate profiler depending on pedal config
		if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
		{
		  profiler_serialCommunicationTask.activate( true );
		}
		else
		{
		  profiler_serialCommunicationTask.activate( false );
		}
	
	
		// start profiler 0, overall function
		profiler_serialCommunicationTask.start(0);



	  // start profiler 2, serial send
	  profiler_serialCommunicationTask.start(2);


	  // send pedal state structs
	  // update pedal states
	  printCycleCounter++;
	  DAP_state_basic_st dap_state_basic_st_lcl;
	  DAP_state_extended_st dap_state_extended_st_lcl;
		
